In [ ]:
SELECT client_id
FROM client
WHERE district_id = 1
LIMIT 5;

In [ ]:
SELECT client_id
FROM client
WHERE district_id = 72
ORDER BY client_id DESC
LIMIT 1;

In [ ]:
SELECT amount
FROM loan
ORDER BY amount ASC
LIMIT 3;

In [ ]:
SELECT DISTINCT status
FROM loan
ORDER BY status ASC;

In [ ]:
SELECT loan_id
FROM loan
ORDER BY payments DESC
LIMIT 1;

In [ ]:
SELECT account_id, amount
FROM loan
ORDER BY account_id ASC
LIMIT 5;

In [ ]:
SELECT account_id, amount
FROM loan
WHERE duration = 60
AND amount = (
    SELECT MIN(amount)
    FROM loan
    WHERE duration = 60
);

In [ ]:
SELECT DISTINCT k_symbol
FROM `order`
ORDER BY k_symbol ASC;

In [ ]:
SELECT order_id
FROM `order`
WHERE account_id = 34;

In [ ]:
SELECT account_id
FROM `order`
WHERE order_id BETWEEN 29540 AND 29560;

In [ ]:
SELECT amount
FROM `order`
WHERE account_to = 30067122;

In [ ]:
SELECT trans_id, date, type, amount
FROM `trans`
WHERE account_id = 793
ORDER BY date DESC
LIMIT 10;

In [ ]:
SELECT district_id, COUNT(*) AS client_count
FROM `client`
WHERE district_id < 10
GROUP BY district_id
ORDER BY district_id ASC;

In [ ]:
SELECT type, COUNT(*) AS card_count
FROM `card`
GROUP BY type
ORDER BY card_count DESC;

In [ ]:
SELECT account_id, SUM(amount) AS total_loan_amount
FROM `loan`
GROUP BY account_id
ORDER BY total_loan_amount DESC
LIMIT 10;

In [ ]:
SELECT date, COUNT(*) AS loan_count
FROM `loan`
WHERE date < 930907
GROUP BY date
ORDER BY date DESC;

In [ ]:
SELECT date, duration, COUNT(*) AS loan_count
FROM `loan`
WHERE date BETWEEN 19971201 AND 19971231
GROUP BY date, duration
ORDER BY date ASC, duration ASC;

In [ ]:
SELECT account_id, type, SUM(amount) AS total_amount
FROM `trans`
WHERE account_id = 396
GROUP BY type
ORDER BY type ASC;